<a href="https://colab.research.google.com/github/junio-firmino/Aprendizado_python/blob/master/scores.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
import pandas as pd
import numpy as np

In [44]:
sat_url = '/content/drive/MyDrive/scores.csv'

In [45]:
sat = pd.read_csv(sat_url)

In [46]:
sat

                                     School Name    Borough  ...  SAT Section Score
0          A. Philip Randolph Campus High School  Manhattan  ...         Math   459
1          A. Philip Randolph Campus High School  Manhattan  ...      Reading   453
2          A. Philip Randolph Campus High School  Manhattan  ...      Writing   447
3                    Abraham Lincoln High School   Brooklyn  ...         Math   441
4                    Abraham Lincoln High School   Brooklyn  ...      Reading   422
...                                          ...        ...  ...          ...   ...
1120  Young Women's Leadership School in Astoria     Queens  ...      Reading   464
1121  Young Women's Leadership School in Astoria     Queens  ...      Writing   477
1122   Young Women's Leadership School in Queens     Queens  ...         Math   415
1123   Young Women's Leadership School in Queens     Queens  ...      Reading   420
1124   Young Women's Leadership School in Queens     Queens  ...      Writing   433

[1125 rows x 6 columns]

In [47]:
sat.describe()

       Student Enrollment        Score
count         1125.000000  1125.000000
mean           764.682667   425.302222
std            788.773514    66.471686
min            142.000000   284.000000
25%            397.000000   385.000000
50%            483.000000   409.000000
75%            666.000000   446.000000
max           5447.000000   754.000000

In [48]:
sat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1125 entries, 0 to 1124
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   School Name         1125 non-null   object
 1   Borough             1125 non-null   object
 2   Student Enrollment  1125 non-null   int64
 3   Percent Tested      1125 non-null   object
 4   SAT Section         1125 non-null   object
 5   Score               1125 non-null   int64
dtypes: int64(2), object(4)
memory usage: 52.9+ KB

In [49]:
sat.rename(columns={'Percent Tested':'Percent_Tested','SAT Section':'SAT_Section'}, inplace=True)

In [50]:
sat.head(3)

                             School Name    Borough  ...  SAT_Section Score
0  A. Philip Randolph Campus High School  Manhattan  ...         Math   459
1  A. Philip Randolph Campus High School  Manhattan  ...      Reading   453
2  A. Philip Randolph Campus High School  Manhattan  ...      Writing   447

[3 rows x 6 columns]

In [51]:
sat['Percent_Tested'] = sat.Percent_Tested.replace(r'\%',"",regex=True).astype(float)

In [52]:
sat.groupby('Borough').get_group('Brooklyn').shape

(327, 6)

In [53]:
sat.Borough.describe()

count         1125
unique           5
top       Brooklyn
freq           327
Name: Borough, dtype: object

In [54]:
sat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1125 entries, 0 to 1124
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   School Name         1125 non-null   object
 1   Borough             1125 non-null   object
 2   Student Enrollment  1125 non-null   int64
 3   Percent_Tested      1125 non-null   float64
 4   SAT_Section         1125 non-null   object
 5   Score               1125 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 52.9+ KB

In [55]:
pivoted = sat.pivot(index='School Name',columns='SAT_Section',values='Score')

In [56]:
pivoted

SAT_Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [57]:
pivoted

SAT_Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [58]:
sat.Borough.unique()

array(['Manhattan', 'Brooklyn', 'Queens', 'Bronx', 'Staten Island'],
      dtype=object)

In [59]:
sat.pivot_table(values='Score', index='Borough', columns='SAT_Section', aggfunc='sum')

SAT_Section     Math  Reading  Writing
Borough
Bronx          39627    39447    38793
Brooklyn       45388    44773    43937
Manhattan      40574    39599    39099
Queens         31903    30585    30350
Staten Island   4862     4785     4743

In [60]:
sat.pivot_table(values='Percent_Tested', index='Borough',columns='SAT_Section')

SAT_Section         Math    Reading    Writing
Borough
Bronx          58.220408  58.220408  58.220408
Brooklyn       62.423853  62.423853  62.423853
Manhattan      71.197753  71.197753  71.197753
Queens         69.036232  69.036232  69.036232
Staten Island  67.390000  67.390000  67.390000

In [61]:
sat.pivot_table(values='Percent_Tested', index='Borough',columns='SAT_Section',aggfunc='min')

SAT_Section    Math  Reading  Writing
Borough
Bronx          19.2     19.2     19.2
Brooklyn       18.5     18.5     18.5
Manhattan      30.6     30.6     30.6
Queens         26.3     26.3     26.3
Staten Island  38.0     38.0     38.0

In [62]:
sat.pivot_table(values='Percent_Tested', index='Borough',columns='SAT_Section',aggfunc='mean').sort_values(by='Math',ascending=False)

SAT_Section         Math    Reading    Writing
Borough
Manhattan      71.197753  71.197753  71.197753
Queens         69.036232  69.036232  69.036232
Staten Island  67.390000  67.390000  67.390000
Brooklyn       62.423853  62.423853  62.423853
Bronx          58.220408  58.220408  58.220408

In [63]:
sat.pivot_table(values='Percent_Tested', index='Borough',columns='SAT_Section').sort_values(by='Math',ascending=False)

SAT_Section         Math    Reading    Writing
Borough
Manhattan      71.197753  71.197753  71.197753
Queens         69.036232  69.036232  69.036232
Staten Island  67.390000  67.390000  67.390000
Brooklyn       62.423853  62.423853  62.423853
Bronx          58.220408  58.220408  58.220408

In [64]:
sat['Sat_takers'] = sat['Percent_Tested']*sat['Student Enrollment']/100

In [65]:
sat

                                     School Name    Borough  ...  Score  Sat_takers
0          A. Philip Randolph Campus High School  Manhattan  ...    459    1001.960
1          A. Philip Randolph Campus High School  Manhattan  ...    453    1001.960
2          A. Philip Randolph Campus High School  Manhattan  ...    447    1001.960
3                    Abraham Lincoln High School   Brooklyn  ...    441    1285.209
4                    Abraham Lincoln High School   Brooklyn  ...    422    1285.209
...                                          ...        ...  ...    ...         ...
1120  Young Women's Leadership School in Astoria     Queens  ...    464     572.000
1121  Young Women's Leadership School in Astoria     Queens  ...    477     572.000
1122   Young Women's Leadership School in Queens     Queens  ...    415     503.528
1123   Young Women's Leadership School in Queens     Queens  ...    420     503.528
1124   Young Women's Leadership School in Queens     Queens  ...    433     503.528

[1125 rows x 7 columns]

In [66]:
pivoted

SAT_Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [67]:
pivoted.reset_index().melt(id_vars='School Name')

                                            School Name SAT_Section  value
0                 A. Philip Randolph Campus High School        Math    459
1                           ACORN Community High School        Math    379
2                           Abraham Lincoln High School        Math    441
3            Academy for Careers in Television and Film        Math    444
4     Academy for College Preparation and Career Exp...        Math    386
...                                                 ...         ...    ...
1120       World Journalism Preparatory (College Board)     Writing    487
1121                         York Early College Academy     Writing    473
1122                    Young Women's Leadership School     Writing    472
1123         Young Women's Leadership School in Astoria     Writing    477
1124          Young Women's Leadership School in Queens     Writing    433

[1125 rows x 3 columns]

In [68]:
sat

                                     School Name    Borough  ...  Score  Sat_takers
0          A. Philip Randolph Campus High School  Manhattan  ...    459    1001.960
1          A. Philip Randolph Campus High School  Manhattan  ...    453    1001.960
2          A. Philip Randolph Campus High School  Manhattan  ...    447    1001.960
3                    Abraham Lincoln High School   Brooklyn  ...    441    1285.209
4                    Abraham Lincoln High School   Brooklyn  ...    422    1285.209
...                                          ...        ...  ...    ...         ...
1120  Young Women's Leadership School in Astoria     Queens  ...    464     572.000
1121  Young Women's Leadership School in Astoria     Queens  ...    477     572.000
1122   Young Women's Leadership School in Queens     Queens  ...    415     503.528
1123   Young Women's Leadership School in Queens     Queens  ...    420     503.528
1124   Young Women's Leadership School in Queens     Queens  ...    433     503.528

[1125 rows x 7 columns]

In [69]:
sat.groupby('Borough')['Score','Sat_takers'].agg('sum')  # Agrupar e escolher quais colunas utilizar na análise.

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                Score  Sat_takers
Borough
Bronx          117867   94822.023
Brooklyn       134098  163076.472
Manhattan      119272  127455.354
Queens          92838  154823.073
Staten Island   14390   38137.875

In [70]:
sat.groupby('Borough')['Score','Sat_takers'].agg('mean')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                    Score   Sat_takers
Borough
Bronx          400.908163   322.523888
Brooklyn       410.085627   498.704807
Manhattan      446.711610   477.360876
Queens         448.492754   747.937551
Staten Island  479.666667  1271.262500

In [71]:
sat.isna().sum()

School Name           0
Borough               0
Student Enrollment    0
Percent_Tested        0
SAT_Section           0
Score                 0
Sat_takers            0
dtype: int64

In [72]:
pivoted.head(4)

SAT_Section                                 Math  Reading  Writing
School Name
A. Philip Randolph Campus High School        459      453      447
ACORN Community High School                  379      395      385
Abraham Lincoln High School                  441      422      422
Academy for Careers in Television and Film   444      458      444

In [73]:
pivoted.reset_index().melt(id_vars='School Name')

                                            School Name SAT_Section  value
0                 A. Philip Randolph Campus High School        Math    459
1                           ACORN Community High School        Math    379
2                           Abraham Lincoln High School        Math    441
3            Academy for Careers in Television and Film        Math    444
4     Academy for College Preparation and Career Exp...        Math    386
...                                                 ...         ...    ...
1120       World Journalism Preparatory (College Board)     Writing    487
1121                         York Early College Academy     Writing    473
1122                    Young Women's Leadership School     Writing    472
1123         Young Women's Leadership School in Astoria     Writing    477
1124          Young Women's Leadership School in Queens     Writing    433

[1125 rows x 3 columns]

In [74]:
sat.pivot_table(values='Score', index='Borough', columns='SAT_Section',aggfunc='mean', margins=True,margins_name='Media global')

SAT_Section          Math     Reading     Writing  Media global
Borough
Bronx          404.357143  402.520408  395.846939    400.908163
Brooklyn       416.403670  410.761468  403.091743    410.085627
Manhattan      455.887640  444.932584  439.314607    446.711610
Queens         462.362319  443.260870  439.855072    448.492754
Staten Island  486.200000  478.500000  474.300000    479.666667
Media global   432.944000  424.504000  418.458667    425.302222

In [75]:
sat.pivot_table(values='Score', index='Borough', columns='SAT_Section',aggfunc=['min','max'])

               min                  max
SAT_Section   Math Reading Writing Math Reading Writing
Borough
Bronx          317     311     292  714     672     672
Brooklyn       319     302     284  682     608     606
Manhattan      344     330     316  754     697     693
Queens         340     320     318  701     640     661
Staten Island  420     427     409  711     660     670

In [76]:
# desafio
sat.head(2)

                             School Name    Borough  ...  Score  Sat_takers
0  A. Philip Randolph Campus High School  Manhattan  ...    459     1001.96
1  A. Philip Randolph Campus High School  Manhattan  ...    453     1001.96

[2 rows x 7 columns]

In [77]:
sat.pivot_table(values='Student Enrollment',index='Borough', aggfunc='sum')

               Student Enrollment
Borough
Bronx                      159267
Brooklyn                   242814
Manhattan                  170370
Queens                     232437
Staten Island               55380

In [78]:
teste = sat[sat.Borough == 'Queens']

In [79]:
sat[sat.Borough == 'Queens'].sum(numeric_only=True)

Student Enrollment    232437.000
Percent_Tested         14290.500
Score                  92838.000
Sat_takers            154823.073
dtype: float64

In [81]:
sat[sat.Borough == 'Queens'].mean(numeric_only=True)

Student Enrollment    1122.884058
Percent_Tested          69.036232
Score                  448.492754
Sat_takers             747.937551
dtype: float64

In [82]:
teste.head(3)

                                  School Name Borough  ...  Score  Sat_takers
6  Academy for Careers in Television and Film  Queens  ...    444      489.25
7  Academy for Careers in Television and Film  Queens  ...    458      489.25
8  Academy for Careers in Television and Film  Queens  ...    444      489.25

[3 rows x 7 columns]

In [85]:
teste.groupby('SAT_Section').agg('mean')

             Student Enrollment  Percent_Tested       Score  Sat_takers
SAT_Section
Math                1122.884058       69.036232  462.362319  747.937551
Reading             1122.884058       69.036232  443.260870  747.937551
Writing             1122.884058       69.036232  439.855072  747.937551

In [87]:
teste.groupby('SAT_Section')['Score'].agg('mean')

SAT_Section
Math       462.362319
Reading    443.260870
Writing    439.855072
Name: Score, dtype: float64

In [90]:
teste.groupby('SAT_Section')['Score','Sat_takers'].agg('mean')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                  Score  Sat_takers
SAT_Section
Math         462.362319  747.937551
Reading      443.260870  747.937551
Writing      439.855072  747.937551